Repository: japsit/woocommerce-product-gallery-with-quote-button
Catalog: languages/product-gallery-with-quote-button-*.po
Languages: fi

source: Cancel
fi: Peruuta

source: Contact details
fi: Yhteystiedot

source: Contact us
fi: Lähetä viesti

source: Create a frontend product gallery and add quote button to each product
fi: Luo galleria ja lisää Tee tarjous -painikkeet

source: Description
fi: Kuvaus

source: Email
fi: Sähköposti

source: Gallery with Quote
fi: Tarjousgalleria

source: Gallery with Quote settings
fi: Tarjousgallerian asetukset

source: Message has been sent successfully
fi: Viesti lähetettiin onnistuneesti.

source: Message not sent. Error occured.
fi: Viestiä ei lähetetty virheen vuoksi.

source: Message sent successfully
fi: Viesti lähetetty onnistuneesti.

source: Name
fi: Nimi

source: Nonce failed.
fi: Varmennus epäonnistui.

source: Price
fi: Hinta

source: Product
fi: Tuota

source: Product Gallery with Quote Button
fi: Tarjousgalleria

source: Product id
fi: Tuotenumero

source: Product name
fi: Tuotteen nimi

source: Request quote
fi: Tee tarjous

source: Send
fi: Lähetä

source: Sending message failed
fi: Viestin lähettäminen epäonnistui

source: Telephone
fi: Puhelin
